app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def edit
    @category = Category.find_by(id: params[:id])
    @categories = Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Cars2"], ["updated_at", "2020-01-03 13:24:54.160907"], ["id", 2]]
---
  def update
    @category = Category.find_by(id: params[:id])
    if @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def show
    @category = Category.find_by(id: params[:id])
    @categories = Category.all

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 1]]
---
  def destroy
    @category = Category.find_by(id: params[:id])
    @category.destroy