app/controllers/images_controller.rb

INSERT INTO "images" ("image", "image_title", "image_file_size", "image_content_type", "image_description", "category_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@image = Image.new(image_params)
  	if @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]
---
  def destroy
    @image=Image.find_by(id: params[:id])
    @image.destroy

SELECT  "images".* FROM "images" WHERE "images"."id" IS NULL LIMIT ?  [["LIMIT", 1]]
SELECT "images".* FROM "images"
SELECT "categories".* FROM "categories"
---
  def index
    @image=Image.find_by(id: params[:id])
  	@images = Image.all
  	@categories = Category.all