app/views/images/new.html.erb

SELECT "categories".* FROM "categories"
---
		<%= f.label :category %>
		<%= f.select :category_id, Category.all.collect {